function displayHeader() {
  process.stdout.write('\x1Bc');
  console.log('================================================================================'.rainbow);
  console.log('=                      🚀🎮 EVM Auto Deploy 🎮🚀                                ='.cyan.bold);
  console.log('=                        Created by Hidden Gem                                   ='.magenta);
  console.log('=                       https://t.me/hiddengemnews                               ='.blue);
  console.log('= ██╗  ██╗██╗██████╗ ██████╗ ███████╗███╗   ██╗     ██████╗ ███████╗███╗   ███╗  ='.yellow);
  console.log('= ██║  ██║██║██╔══██╗██╔══██╗██╔════╝████╗  ██║    ██╔════╝ ██╔════╝████╗ ████║  ='.yellow);
  console.log('= ███████║██║██║  ██║██║  ██║█████╗  ██╔██╗ ██║    ██║  ███╗█████╗  ██╔████╔██║  ='.yellow);
  console.log('= ██╔══██║██║██║  ██║██║  ██║██╔══╝  ██║╚██╗██║    ██║   ██║██╔══╝  ██║╚██╔╝██║  ='.yellow);
  console.log('= ██║  ██║██║██████╔╝██████╔╝███████╗██║ ╚████║    ╚██████╔╝███████╗██║ ╚═╝ ██║  ='.yellow);
  console.log('= ╚═╝  ╚═╝╚═╝╚═════╝ ╚═════╝ ╚══════╝╚═╝  ╚═══╝     ╚═════╝ ╚══════╝╚═╝HiddenGem ='.yellow);
  console.log('================================================================================'.rainbow);
  console.log();
